#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 0s
data.aws_iam_policy_document.assume_role_node: Reading...
data.aws_iam_policy_document.assume_role_cluster: Reading...
aws_ecr_repository.cook_api: Refreshing state... [id=fiap-irango-ecr/fiap-irango-cook-api]
aws_ecr_repository.order_api: Refreshing state... [id=fiap-irango-ecr/fiap-irango-order-api]
aws_ecr_repository.payment_api: Refreshing state... [id=fiap-irango-ecr/fiap-irango-payment-api]
aws_security_group.eks: Refreshing state... [id=sg-094489dd412977026]
data.aws_iam_policy_document.assume_role_cluster: Read complete after 0s [id=3552664922]
data.aws_iam_policy_document.assume_role_node: Read complete after 0s [id=2851119427]
aws_iam_role.eks_node: Refreshing state... [id=fiap-irango-eks-node]
aws_iam_role.eks_cluster: Refreshing state... [id=fiap-irango-k8s-cluster]
aws_iam_role_policy_attachment.eks_node-AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=fiap-irango-eks-node-20240715155658137000000001]
aws_iam_role_policy_attachment.eks_node-AmazonEKSWorkerNodePolicy: Refreshing state... [id=fiap-irango-eks-node-20240715155658180300000002]
aws_iam_role_policy_attachment.eks_node-AmazonEKS_CNI_Policy: Refreshing state... [id=fiap-irango-eks-node-20240715155658230700000005]
aws_iam_role_policy_attachment.eks_cluster-AmazonEKSServicePolicy: Refreshing state... [id=fiap-irango-k8s-cluster-20240715155658206600000004]
aws_iam_role_policy_attachment.eks_cluster-AmazonEKSVPCResourceController: Refreshing state... [id=fiap-irango-k8s-cluster-20240715155658189800000003]
aws_iam_role_policy_attachment.eks_cluster-AmazonEKSClusterPolicy: Refreshing state... [id=fiap-irango-k8s-cluster-20240715155658243300000006]
aws_ecr_lifecycle_policy.order_api: Refreshing state... [id=fiap-irango-ecr/fiap-irango-order-api]
aws_ecr_lifecycle_policy.payment_api: Refreshing state... [id=fiap-irango-ecr/fiap-irango-payment-api]
aws_ecr_lifecycle_policy.cook_api: Refreshing state... [id=fiap-irango-ecr/fiap-irango-cook-api]
aws_eks_cluster.default: Refreshing state... [id=fiap-irango-k8s-cluster]
aws_eks_node_group.api: Refreshing state... [id=fiap-irango-k8s-cluster:fiap-irango-k8s-node-group-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.api must be replaced
-/+ resource "aws_eks_node_group" "api" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:166954469144:nodegroup/fiap-irango-k8s-cluster/fiap-irango-k8s-node-group-api/d8c85b91-f89b-a2d6-2165-2faa152ba09d" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "fiap-irango-k8s-cluster:fiap-irango-k8s-node-group-api" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t3.micro",
          + "t3.medium",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.30.0-20240703" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-fiap-irango-k8s-node-group-api-d8c85b91-f89b-a2d6-2165-2faa152ba09d"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "Name" = "fiap-irango-eks-node-group-api"
        }
      ~ version                = "1.30" -> (known after apply)
        # (5 unchanged attributes hidden)

      - update_config {
          - max_unavailable            = 1 -> null
          - max_unavailable_percentage = 0 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>